package com.example.zverek.myapplication;

import android.graphics.Typeface;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.support.v7.widget.Toolbar;
import android.view.Window;
import android.view.WindowManager;
import android.widget.TabHost;
import android.widget.TextView;
import android.widget.Toast;

public class NamazKuptanActivity extends AppCompatActivity {
    StringBuilder stringBuilder = new StringBuilder();
    StringBuilder stringBuilder2 = new StringBuilder();
    StringBuilder stringBuilder3 = new StringBuilder();
    TextView textView = null;
    TextView textView2 = null;
    TextView textView3 = null;
    String pathToShrift2 = "fonts/calibri.ttf";
    Typeface typefacen2;
    String str1 = "Куптан намазы:\n" +
            "Куптан намазы алгач төрт рекет парз, анан эки рекет сүннөт , андан соң үч рекет уитир-уажип намазы окулат. Куптан намазынын төрт рекет парзы төмөнкүчө окулат:\n" +
            "\n" +
            "1)  Ниет кылдым куптан намазынын төрт рекет парзын калыс Аллах үчүн окууга, жүзүмдү кыбылага бурдум.\n" +
            "\n" +
            "\n" +
            "2)  \"Аллооху Акбар\" - деп эки кол кулак жумашактарына көтөрүлөт, айалдар болсо көкүрөктөрүнө көтөрүшөт. Анан кол байланат.\n" +
            "\n" +
            "\n" +
            "3)  Оң кол сол колдун үстүнө койулуп киндиктин алдына байланат, айалдар болсо көкүрөктөрүнө байлашат. Бул акыбалда төмөнкүлөр окулат:\n" +
            "\tA) Субхаанака аллоохумма уа бихамдика уа табаарокасмука уа таалаа жаддука уа лаа илааха гойрук.\n" +
            "\tБ) Ауузу биллаахи минаш-шайтоонир-рожиим.\n" +
            "\tВ) Бисмил-лаахир-рохмаанир-рохиим.\n" +
            "\tГ) Алхамду лиллахи роббил ааламиин.\n" +
            "\tАррохмаанир-рохиим.\n" +
            "\tМаалики йаумид-диин.\n" +
            "\tИййаака набуду уа иййаака настаиин.\n" +
            "\tИхдинас-сыроотол-мустакыым.\n" +
            "\tСыроотол-лазиина анамта алайхим .\n" +
            "\tГойрил магдууби алайхим уа ладдоолиин.\n" +
            "\t\"Амиин\" - деп ичтен купуйа айтылат.\n" +
            "\tФатихадан соң өзү билген кошумча сүрөө окулат, мисалы: \"Каусар\" - сүрөөсү.\n" +
            "\tД) Уал аср иннал инсаана лафии хуср\n" +
            "\tИллал-лазиина аамануу уа амилус-соолихаати \n" +
            "\tУа тауаасоубил хаккы уа тауаа соубис-собр \n" +
            "\t\"Аллоху Акбар\" -деп рүкүгө кетет.\n" +
            "\n" +
            "4)  Рүкүдө үч жолу \"Сухбаана роббийал азиим\" - деп айткан соң,\n" +
            "\t\"Самиаллооху лиман хамидах\" - деп кайра тик турат.\n" +
            "\n" +
            "\n" +
            "5)  Тик турган соң \"Аллооху Акбар\" - деп саждага кетет. Сажда абалында \"Субхаана роббийал аалаа\" - деп үч жолу айтылат,\n" +
            "\t\"Аллооху Акбар\" - деп баш көтөрүп каадага олтурат жана эки жолу \"Роббигфир лии\" - деп айтат.\n" +
            "\tКайра экинчи саждага \"Аллооху Акбар\" - деп барып \"Субхаана роббийал аалаа\" - деп үч жолу айтылат.\n" +
            "\tМындан соң \"Аллооху Акбар\" - деп экинчи рекетке дароо туруп кол байлайт.\n" +
            "\n" +
            "\n" +
            "6)  Кол байлагандан кийин кайра Фатиха сүрөө кошумча сүрөө менен окулат: \n" +
            "\tБисмл-лаахир-рохмаанир-рохиим\n" +
            "\tАлхамду лиллаахи роббил ааламиин\n" +
            "\tАррохмаанир-рохиим.\n" +
            "\tМаалики йаумид-диин.\n" +
            "\tИййаака набуду уа иййаака настаиин.\n" +
            "\tИхдинас-сыроотол-мустакыым.\n" +
            "\tСыроотол-лазиина анамта алайхим.\n" +
            "\tГойрил магдууби алайхим уа ладдоолиин.\n" +
            "\t\"Амиин\" - деп ичтен купуйа айтылат.\n" +
            "\tКул хуал-лооху ахад, аллоохус-сомад\n" +
            "\tЛам йалид уа лам йуулад\n" +
            "\tУа лам йакул-лахуу куфууан ахад.\n" +
            "\n" +
            "\n" +
            "7)  Рүкүгө барат \"Аллооху Акбар\" - деп. Рүкүдө үч жолу \"Сухбаана роббийал азиим\" - деп айткан соң,\n" +
            "\t\"Самиаллооху лиман хамидах\" - деп кайра тик турат.\n" +
            "\tТик турган соң \"Аллооху Акбар\" - деп саждага кетет. Сажда абалында \"Субхаана роббийал аалаа\" - деп үч жолу айтат,\n" +
            "\t\"Аллооху Акбар\" - деп баш көтөрүп каадага олтурат жана эки жолу \"Роббигфир лии\" - деп айтат.\n" +
            "\tАйткан соң \"Аллооху Акбар\" - деп кайра экинчи сажданы кылат, саждада \"Субхаана роббийал аалаа\" - деп үч жолу айтат,\n" +
            "\t\"Аллооху Акбар\" - деп баш көтөрүп каадага олтурат.\n" +
            "\n" +
            "\n" +
            "8)  Каадада \"ат-тахыйат\" - дубасы окулат.\n" +
            "\t\"Аттахыйаату лиллаахи уас-солауаату уат-тоййибаату\n" +
            "\tАссалааму алайка аййухан-набиййу \n" +
            "\tУа рохматуллоохи уа барокаатуху\n" +
            "\tАссалааму алайнаа уа алаа ыбаадил-лаахис-соолихиин\n" +
            "\tАшхаду аллаа илааха иллал-лооху\n" +
            "\tУа ашхаду анна мухаммадан абдуху уа росуулух\".\n" +
            "\n" +
            "\n";
    String str2 = "9)  \"Аттахыйат\" окулгандан кийин \"Аллоху Акбар\" - деп тик туруп үчүнчү рекетке кол байлайт,\n" +
            "\tКол байлагандан кийин:\n" +
            "\tБисмл-лаахир-рохмаанир-рохиим\n" +
            "\tАлхамду лиллаахи роббил ааламиин\n" +
            "\tАррохмаанир-рохиим.\n" +
            "\tМаалики йаумид-диин.\n" +
            "\tИййаака набуду уа иййаака настаиин.\n" +
            "\tИхдинас-сыроотол-мустакыым.\n" +
            "\tСыроотол-лазиина анамта алайхим.\n" +
            "\tГойрил магдууби алайхим уа ладдоолиин.\n" +
            "\t\"Амиин\" - деп ичтен купуйа айтылат.\n" +
            "\tҮчүнчү рекет парздан кийин кошумча сүрөө окулбайт.\n" +
            "\t\"Аллооху Акбар\" - деп рүкүгө барат.\n" +
            "\n" +
            "\n" +
            "10)  Рүкүдө үч жолу \"Сухбаана роббийал азиим\" - деп айткан соң\n" +
            "\"Самиаллооху лиман хамидах\" - деп кайра тик турат.\n" +
            "\n" +
            "\n" +
            "11)  Тик турган соң \"Аллооху Акбар\" - деп саждага кетет. Сажда абалында \"Субхаана роббийал аалаа\" - деп үч жолу айтат,\n" +
            "\t\"Аллооху Акбар\" - деп баш көтөрүп каадага олтурат жана эки жолу \"Роббигфир лии\" - деп айтат.\n" +
            "\tКайра экинчи саждага \"Аллооху Акбар\" - деп барып \"Субхаана роббийал аалаа\" - деп үч жолу айтылат.\n" +
            "\tМындан соң \"Аллооху Акбар\" - деп төртүнчү рекетке дароо туруп кол байлайт.\n" +
            "\n" +
            "\n" +
            "12)  Кол байлагандан кийин кайра Фатиха сүрөө кошумча сүрөө менен окулат:\n" +
            "\tБисмл-лаахир-рохмаанир-рохиим\n" +
            "\tАлхамду лиллаахи роббил ааламиин\n" +
            "\tАррохмаанир-рохиим.\n" +
            "\tМаалики йаумид-диин.\n" +
            "\tИййаака набуду уа иййаака настаиин.\n" +
            "\tИхдинас-сыроотол-мустакыым.\n" +
            "\tСыроотол-лазиина анамта алайхим.\n" +
            "\tГойрил магдууби алайхим уа ладдоолиин.\n" +
            "\t\"Амиин \" - деп ичтен купуйа айтылат.\n" +
            "\tТөртүнчү рекет парздан кийин дагы кошумча сүрөө окулбайт.\n" +
            "\t\"Аллооху Акбар\" - деп рүкүгө кетет.\n" +
            "\n" +
            "13)  Рүкүдө үч жолу \"Сухбаана роббийал азиим\" - деп айткан соң\n" +
            "\t\"Самиаллооху лиман хамидах\" - деп кайра тик турат.\n" +
            "\tТик турган соң \"Аллооху Акбар\" - деп саждага кетет. Сажда абалында \"Субхаана роббийал аалаа\" - деп үч жолу айтат,\n" +
            "\t\"Аллооху Акбар\" - деп баш көтөрүп каадага олтурат жана эки жолу \"Роббигфир лии\" - деп айтат.\n" +
            "\tАйткан соң \"Аллооху Акбар\" - деп кайра экинчи сажданы кылат, саждада \"Субхаана роббийал аалаа\" - деп үч жолу айтат,\n" +
            "\t\"Аллооху Акбар\" - деп баш көтөрүп каадага олтурат.\n" +
            "\n" +
            "\n" +
            "14)  Каадада \"ат-тахыйат\" - дубасы окулат.\n" +
            "\tАттахыйаату лиллаахи уас-солауаату уат-тоййибаату\n" +
            "\tАссалааму алайка аййухан-набиййу \n" +
            "\tУа рохматуллоохи уа барокаатуху\n" +
            "\tАссалааму алайнаа уа алаа ыбаадил-лаахис-соолихиин\n" +
            "\tАшхаду аллаа илааха иллал-лооху\n" +
            "\tУа ашхаду анна мухаммадан абдуху уа росуулух \n" +
            "\n" +
            "\tМындан соң \"Салауат\" окулат.\n" +
            "\tАллоохумма солли алаа мухаммадин уа алаа аали мухаммад\n" +
            "\tКамаа соллайта алаа Иброохиима уа алаа аали Иброохима\n" +
            "\tИннака хамиидум-мажиид\n" +
            "\tАллоохумма баарик алаа мухаммадин уа алаа аали мухаммад\n" +
            "\tКамаа баарокта алаа Иброохиима уа алаа аали Иброохима\n" +
            "\tИннака хамиидум-мажиид.\n" +
            "\n" +
            "\tМындан соң бир дуба окулат:\n" +
            "\tРоббанаа аатинаа фид-дунйаа хасанатан \n" +
            "\tУа фил аахироти хасанатан \n" +
            "\tУа кынаа азаабан-наар.\n" +
            "\n" +
            "\n" +
            "15)  \"Ассалааму алайкум уа рохматуллох\" - деп оң ийинге салам берилет,\n" +
            "\tжана ушундай эле сол ийинге \"Ассалааму алайкум уа рохматуллох\"-салам берилет.\n" +
            "\n" +
            "\n" +
            "16)  Эки тарапка салам берген соң \"Астагфируллоох\"- сөзүн үч мертебе айтып, \"Аллоохумма антас-салаам уа минкас-салаам табаарокта йаа зал жалаали \n" +
            "\tуал икроом\" - деп эки алаканын жайып Аллага дуба кылат: \"Аллохумма аыннии алаа зикрика уа шукрика уа хусни ыбаадатика\".\n" +
            "\tМындан соң куптан намазынын төрт рекет парзы бүттү деп эсептелет";








    String str3 = "Куптан намазынын үч рекет витир важиби төмөнкүчө окулат\n" +
            "\n" +
            "1)  Ниет кылдым витир важип намазынын үч рекетин калыс Аллах үчүн окууга, жүзүмдү кыбылага бурдум.\n" +
            "\n" +
            "\n" +
            "2)  \"Аллооху Акбар\" - деп эки кол кулак жумашактарына көтөрүлөт, айалдар болсо көкүрөктөрүнө көтөрүшөт. Анан кол байланат.\n" +
            "\n" +
            "\n" +
            "3)  Оң кол сол колдун үстүнө койулуп киндиктин алдына байланат, айалдар болсо көкүрөктөрүнө байлашат. Бул акыбалда төмөнкүлөр окулат:\n" +
            "\tA) Субхаанака аллоохумма уа бихамдика уа табаарокасмука уа таалаа жаддука уа лаа илааха гойрук.\n" +
            "\tБ) Ауузу биллаахи минаш-шайтоонир-рожиим.\n" +
            "\tВ) Бисмил-лаахир-рохмаанир-рохиим.\n" +
            "\tГ) Алхамду лиллахи роббил ааламиин.\n" +
            "\tАррохмаанир-рохиим.\n" +
            "\tМаалики йаумид-диин.\n" +
            "\tИййаака набуду уа иййаака настаиин.\n" +
            "\tИхдинас-сыроотол-мустакыым.\n" +
            "\tСыроотол-лазиина анамта алайхим .\n" +
            "\tГойрил магдууби алайхим уа ладдоолиин.\n" +
            "\t\"Амиин\" - деп ичтен купуйа айтылат.\n" +
            "\tФатихадан соң өзү билген кошумча сүрөө окулат, мисалы: \"Каусар\" -сүрөөсү.\n" +
            "\tД) Уал аср иннал инсаана лафии хуср\n" +
            "\tИллал-лазиина аамануу уа амилус-соолихаати \n" +
            "\tУа тауаасоубил хаккы уа тауаа соубис-собр \n" +
            "\t\"Аллоху Акбар \" - деп рүкүгө кетет.\n" +
            "\n" +
            "\n" +
            "4)  Рүкүдө үч жолу \"Сухбаана роббийал азиим\" - деп айткан соң,\n" +
            "    \"Самиаллооху лиман хамидах\" - деп кайра тик турат.\n" +
            "\n" +
            "\n" +
            "5)  Тик турган соң \"Аллооху Акбар\" - деп саждага кетет.\n" +
            "\tСажда абалында \"Субхаана роббийал аалаа\" - деп үч жолу айтылат,\n" +
            "\t\"Аллооху Акбар\" - деп баш көтөрүп каадага олтурат жана эки жолу \"Роббигфир лии\" - деп айтат.\n" +
            "\tКайра экинчи саждага \"Аллооху Акбар\" - деп барып \"Субхаана роббийал аалаа\" - деп үч жолу айтылат.\n" +
            "\tМындан соң \"Аллооху Акбар\" - деп экинчи рекетке туруп кол байлайт.\n" +
            "\n" +
            "\n" +
            "6)  Кол байлагандан кийин кайра Фатиха сүрөө кошумча сүрөө менен окулат: \n" +
            "\tБисмл-лаахир-рохмаанир-рохиим\n" +
            "\tАлхамду лиллаахи роббил ааламиин\n" +
            "\tАррохмаанир-рохиим.\n" +
            "\tМаалики йаумид-диин.\n" +
            "\tИййаака набуду уа иййаака настаиин.\n" +
            "\tИхдинас-сыроотол-мустакыым.\n" +
            "\tСыроотол-лазиина анамта алайхим.\n" +
            "\tГойрил магдууби алайхим уа ладдоолиин.\n" +
            "\t\"Амиин\" - деп ичтен купуйа айтылат.\n" +
            "\tКул хуал-лооху ахад, аллоохус-сомад\n" +
            "\tЛам йалид уа лам йуулад\n" +
            "\tУа лам йакул-лахуу куфууан ахад.\n" +
            "\n" +
            "7)  Рүкүгө барат \"Аллооху Акбар\" - деп. Рүкүдө үч жолу \"Сухбаана роббийал азиим\" - деп айткан соң,\n" +
            "\t\"Самиаллооху лиман хамидах\" - деп кайра тик турат.\n" +
            "\tТик турган соң \"Аллооху Акбар\" - деп саждага кетет. Сажда абалында \"Субхаана роббийал аалаа\" - деп үч жолу айтат,\n" +
            "\t\"Аллооху Акбар\" - деп баш көтөрүп каадага олтурат жана эки жолу \"Роббигфир лии\" - деп айтат.\n" +
            "\tАйткан соң \"Аллооху Акбар\" - деп кайра экинчи сажданы кылат, саждада \"Субхаана роббийал аалаа\" - деп үч жолу айтат,\n" +
            "\t\"Аллооху Акбар\" - деп баш көтөрүп каадага олтурат.\n" +
            "\n" +
            "\n" +
            "8)  Каадада \"ат-тахыйат\" - дубасы окулат.\n" +
            "\t\"Аттахыйаату лиллаахи уас-солауаату уат-тоййибаату\n" +
            "\tАссалааму алайка аййухан-набиййу \n" +
            "\tУа рохматуллоохи уа барокаатуху\n" +
            "\tАссалааму алайнаа уа алаа ыбаадил-лаахис-соолихиин\n" +
            "\tАшхаду аллаа илааха иллал-лооху\n" +
            "\tУа ашхаду анна мухаммадан абдуху уа росуулух\".\n" +
            "\n" +
            "\n";
    String str4 = "9)  \"Аттахыйат\" окулгандан кийин \"Аллоху Акбар\" - деп тик туруп үчүнчү рекетке кол байлайт,\n" +
            "\tКол байлагандан кийин:\n" +
            "\tБисмл-лаахир-рохмаанир-рохиим\n" +
            "\tАлхамду лиллаахи роббил ааламиин\n" +
            "\tАррохмаанир-рохиим.\n" +
            "\tМаалики йаумид-диин.\n" +
            "\tИййаака набуду уа иййаака настаиин.\n" +
            "\tИхдинас-сыроотол-мустакыым.\n" +
            "\tСыроотол-лазиина анамта алайхим.\n" +
            "\tГойрил магдууби алайхим уа ладдоолиин.\n" +
            "\t\"Амиин\" - деп ичтен купуйа айтылат.\n" +
            "\tКул ауузу бироббил фалак \n" +
            "\tМин шарри маа холак \n" +
            "\tУа мин шарри гоосикын иза уакоб\n" +
            "\tУа мин шаррин-наффаасаати фил укод\n" +
            "\tУа мин шарри хаасидин изаа хасад\n" +
            "\n" +
            "\n" +
            "\tКошумча сүрөө окуп бүткөн соң рүкү кылбастан кулак кагылып кунут дубасы окулат.\n" +
            "\n" +
            "\n" +
            "\tКунут дубасы\n" +
            "\tАллохумма иннаа настаыынука уа настагфирука уа настахдиика уа нумину бика уа натуубу илайка натауаккалу алайка уа нуснии алайкал хойро куллаху, нашкурука уа лаа накфурука уа нахлау уа натруку май-йафжурука.\n" +
            "\tАллохумма иййаака набуду уа лака нусоллии уа насжуду уа илайка насаа уа нахфиду уа наржуу рохматака уа нахшаа азаабака инна азаабака бил куффаари мулхык.\n" +
            "\tКунут дубасы окулуп бүткөндө \"Аллоху Акбар\" - деп рүкүгө барат. Рүкүдө үч жолу \"Сухбаана роббийал азиим\" - деп айткан соң\n" +
            "\n" +
            "\n" +
            "\t\"Самиаллооху лиман хамидах\" - деп кайра тик турат.\n" +
            "\n" +
            "\n" +
            "\tТик турган соң \"Аллооху Акбар\" - деп саждага кетет. Сажда абалында \"Субхаана роббийал аалаа\" - деп үч жолу айтат,\n" +
            "\n" +
            "\n" +
            "\t\"Аллооху Акбар\" - деп баш көтөрүп каадага олтурат жана эки жолу \"Роббигфир лии\" - деп айтат.\n" +
            "\n" +
            "\n" +
            "\tайткан соң \"Аллооху Акбар\" - деп кайра экинчи сажданы, сажда абалында \"Субхаана роббийал аалаа\" -деп үч жолу айтып каадага олтурат\n" +
            "\n" +
            "\n" +
            "8)  Каадада \"ат-тахыйат\" - дубасы окулат.\n" +
            "\tАттахыйаату лиллаахи уас-солауаату уат-тоййибаату\n" +
            "\tАссалааму алайка аййухан-набиййу \n" +
            "\tУа рохматуллоохи уа барокаатуху\n" +
            "\tАссалааму алайнаа уа алаа ыбаадил-лаахис-соолихиин\n" +
            "\tАшхаду аллаа илааха иллал-лооху\n" +
            "\tУа ашхаду анна мухаммадан абдуху уа росуулух \n" +
            "\n" +
            "\tМындан соң \"Салауат\" окулат.\n" +
            "\tАллоохумма солли алаа мухаммадин уа алаа аали мухаммад\n" +
            "\tКамаа соллайта алаа Иброохиима уа алаа аали Иброохима\n" +
            "\tИннака хамиидум-мажиид\n" +
            "\tАллоохумма баарик алаа мухаммадин уа алаа аали мухаммад\n" +
            "\tКамаа баарокта алаа Иброохиима уа алаа аали Иброохима\n" +
            "\tИннака хамиидум-мажиид.\n" +
            "\n" +
            "\tМындан соң бир дуба окулат:\n" +
            "\tРоббанаа аатинаа фид-дунйаа хасанатан \n" +
            "\tУа фил аахироти хасанатан \n" +
            "\tУа кынаа азаабан-наар.\n" +
            "\n" +
            "9)  \"Ассалааму алайкум уа рохматуллох\" - деп оң ийинге салам берилет,\n" +
            "\tжана ушундай эле сол ийинге \"Ассалааму алайкум уа рохматуллох\"-салам берилет.\n" +
            "\n" +
            "\n" +
            "10)  Эки тарапка салам берген соң \"Астагфируллоох\"- сөзүн үч мертебе айтып, \"Аллоохумма антас-салаам уа минкас-салаам табаарокта йаа зал жалаали \n" +
            "\tуал икроом\" - деп эки алаканын жайып Алладан тилегин сурап жыйынтыктайт.\n" +
            "\tКуптан намазынын үч рекет витир важиби бүттү деп эсептелет\n" +
            "\n" +
            "Кошумча зикирлер:\n" +
            "Айат-алКурсийди окуу:\n" +
            "\"Аллооху лаа илааха илла хуал хуййул коййум, лаа тахузуху синату уалаа наум лахуу маа фис-самаауаати уа маа фил арды ман заллазии йашфау ындахуу иллаа биизнихи йаламу маа байна айдиихим уа маа холфахум уа лаа йухыытууна бишайим мин ылмихи илла бимаа шаа уасиа курсиййухус-самаауаати уал ардо уа лаа йауудуху хыфзухума уа хуал алиййул азыым\".\n" +
            "Айат-алКурсини окуп бүткөн соң 33 жолу \"СубхаанАллах\", 33 жолу \"Алхамду лиллаах\", 33 жолу \"Аллоху Акбар\" жана бир жолу \"Лаа илааха иллаллооху уахдаху лаа шариика лахуу лахул мулку уа лахул хамду уа хуа алаа кулли шайин кодиир \" - деп көксөгөн тилек-максаттар суралып, дуба кылынат.";




    String str5 = "Куптан намазынын эки рекет сүннөтү төмөнкүчө окулат\n" +
            "\n" +
            "1)  Ниет кылдым куптан намазынын эки рекет сүннөтүн калыс Аллах үчүн окууга, жүзүмдү кыбылага бурдум.\n" +
            "\n" +
            "\n" +
            "2)  \"Аллооху Акбар\" - деп эки кол кулак жумашактарына көтөрүлөт, айалдар болсо көкүрөктөрүнө көтөрүшөт. Анан кол байланат.\n" +
            "\n" +
            "\n" +
            "3)  Оң кол сол колдун үстүнө койулуп киндиктин алдына байланат, айалдар болсо көкүрөктөрүнө байлашат. Бул акыбалда төмөнкүлөр окулат:\n" +
            "\tA) Субхаанака аллоохумма уа бихамдика уа табаарокасмука уа таалаа жаддука уа лаа илааха гойрук.\n" +
            "\tБ) Ауузу биллаахи минаш-шайтоонир-рожиим.\n" +
            "\tВ) Бисмил-лаахир-рохмаанир-рохиим.\n" +
            "\tГ) Алхамду лиллахи роббил ааламиин.\n" +
            "\tАррохмаанир-рохиим.\n" +
            "\tМаалики йаумид-диин.\n" +
            "\tИййаака набуду уа иййаака настаиин.\n" +
            "\tИхдинас-сыроотол-мустакыым.\n" +
            "\tСыроотол-лазиина анамта алайхим .\n" +
            "\tГойрил магдууби алайхим уа ладдоолиин.\n" +
            "\t\"Амиин\" - деп ичтен купуйа айтылат.\n" +
            "\tД) Кул хуал-лооху ахад, аллоохус-сомад\n" +
            "\tЛам йалид уа лам йуулад\n" +
            "\tУа лам йакул-лахуу куфууан ахад.\n" +
            "\t\"Аллоху Акбар\" - деп рүкүгө кетет.\n" +
            "\n" +
            "\n" +
            "4)  Рүкүдө үч жолу \"Сухбаана роббийал азиим\" - деп айткан соң,\n" +
            "\t\"Самиаллооху лиман хамидах\" - деп кайра тик турат.\n" +
            "\n" +
            "\n" +
            "5)  Тик турган соң \"Аллооху Акбар\" - деп саждага кетет. Сажда абалында \"Субхаана роббийал аалаа\" - деп үч жолу айтылат,\n" +
            "\t\"Аллооху Акбар\" - деп баш көтөрүп каадага олтурат жана эки жолу \"Роббигфир лии\" - деп айтат.\n" +
            "\tКайра экинчи саждага \"Аллооху Акбар\" - деп барып \"Субхаана роббийал аалаа\" - деп үч жолу айтылат.\n" +
            "\tМындан соң \"Аллооху Акбар\" - деп экинчи рекетке туруп кол байлайт.\n" +
            "\n" +
            "\n" +
            "6)  Кол байлагандан кийин кайра Фатиха сүрөө кошумча сүрөө менен окулат: \n" +
            "\tБисмл-лаахир-рохмаанир-рохиим\n" +
            "\tАлхамду лиллаахи роббил ааламиин\n" +
            "\tАррохмаанир-рохиим.\n" +
            "\tМаалики йаумид-диин.\n" +
            "\tИййаака набуду уа иййаака настаиин.\n" +
            "\tИхдинас-сыроотол-мустакыым.\n" +
            "\tСыроотол-лазиина анамта алайхим.\n" +
            "\tГойрил магдууби алайхим уа ладдоолиин.\n" +
            "\t\"Амиин\" - деп ичтен купуйа айтылат.\n" +
            "\tКул ауузу бироббил фалак \n" +
            "\tМин шарри маа холак \n" +
            "\tУа мин шарри гоосикын иза уакоб\n" +
            "\tУа мин шаррин-наффаасаати фил укод\n" +
            "\tУа мин шарри хаасидин изаа хасад\n" +
            "\n" +
            "\n" +
            "7)  Рүкүгө барат \"Аллооху Акбар\" - деп. Рүкүдө үч жолу \"Сухбаана роббийал азиим\" - деп айткан соң,\n" +
            "\t\"Самиаллооху лиман хамидах\" - деп кайра тик турат.\n" +
            "\tТик турган соң \"Аллооху Акбар\" - деп саждага кетет. Сажда абалында \"Субхаана роббийал аалаа\" - деп үч жолу айтат,\n" +
            "\t\"Аллооху Акбар\" - деп баш көтөрүп каадага олтурат жана эки жолу \"Роббигфир лии\" - деп айтат.\n" +
            "\tАйткан соң \"Аллооху Акбар\" - деп кайра экинчи сажданы кылат, саждада \"Субхаана роббийал аалаа\" - деп үч жолу айтат,\n" +
            "\t\"Аллооху Акбар\" - деп баш көтөрүп каадага олтурат.\n" +
            "\n" +
            "\n";
    String str6 = "8)  Каадада \"ат-тахыйат\" - дубасы окулат.\n" +
            "\t\"Аттахыйаату лиллаахи уас-солауаату уат-тоййибаату\n" +
            "\tАссалааму алайка аййухан-набиййу \n" +
            "\tУа рохматуллоохи уа барокаатуху\n" +
            "\tАссалааму алайнаа уа алаа ыбаадил-лаахис-соолихиин\n" +
            "\tАшхаду аллаа илааха иллал-лооху\n" +
            "\tУа ашхаду анна мухаммадан абдуху уа росуулух\".\n" +
            "\n" +
            "\tМындан соң \"Салауат\" окулат.\n" +
            "\tАллоохумма солли алаа мухаммадин уа алаа аали мухаммад\n" +
            "\tКамаа соллайта алаа Иброохиима уа алаа аали Иброохима\n" +
            "\tИннака хамиидум-мажиид\n" +
            "\tАллоохумма баарик алаа мухаммадин уа алаа аали мухаммад\n" +
            "\tКамаа баарокта алаа Иброохиима уа алаа аали Иброохима\n" +
            "\tИннака хамиидум-мажиид.\n" +
            "\n" +
            "\tМындан соң бир дуба окулат:\n" +
            "\tРоббанаа аатинаа фид-дунйаа хасанатан \n" +
            "\tУа фил аахироти хасанатан \n" +
            "\tУа кынаа азаабан-наар.\n" +
            "\n" +
            "9)  \"Ассалааму алайкум уа рохматуллох\" - деп оң ийинге салам берилет,\n" +
            " \tжана ушундай эле сол ийинге \"Ассалааму алайкум уа рохматуллох\" - салам берилет.\n" +
            "\n" +
            "\n" +
            "10)  Эки тарапка салам берген соң \"Астагфируллоох\"- сөзүн үч мертебе айтып, \"Аллоохумма антас-салаам уа минкас-салаам табаарокта йаа зал жалаали уал\n" +
            "\t икроом\" - деп эки алаканын жайып Алладан тилегин сурап жыйынтыктайт.\n" +
            "\t Куптан намазынын эки рекет сүннөтү бүттү деп эсептелет.";
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_namaz_kuptan);
        textView = (TextView) findViewById(R.id.tvTab1);
        textView2 = (TextView) findViewById(R.id.tvTab2);
        textView3 = (TextView) findViewById(R.id.tvTab3);
        typefacen2 = Typeface.createFromAsset(getAssets(),pathToShrift2);
        textView.setTypeface(typefacen2);
        textView2.setTypeface(typefacen2);
        textView3.setTypeface(typefacen2);
        stringBuilder.append(str1);
        stringBuilder.append(str2);

        stringBuilder2.append(str3);
        stringBuilder2.append(str4);

        stringBuilder3.append(str5);
        stringBuilder3.append(str6);

        TabHost tabHost = (TabHost) findViewById(android.R.id.tabhost);
        // инициализация
        tabHost.setup();

        TabHost.TabSpec tabSpec;

        // создаем вкладку и указываем тег
        tabSpec = tabHost.newTabSpec("tag1");
        // название вкладки
        tabSpec.setIndicator("Парз");
        // указываем id компонента из FrameLayout, он и станет содержимым
        tabSpec.setContent(R.id.tvTab1);
        // добавляем в корневой элемент
        tabHost.addTab(tabSpec);

        tabSpec = tabHost.newTabSpec("tag2");
        // указываем название и картинку
        // в нашем случае вместо картинки идет xml-файл,
        // который определяет картинку по состоянию вкладки
        tabSpec.setIndicator("Суннот", getResources().getDrawable(R.drawable.ic_arrow_drop_down_black_24dp));
        tabSpec.setContent(R.id.tvTab2);
        tabHost.addTab(tabSpec);


        tabSpec = tabHost.newTabSpec("tag3");
        // указываем название и картинку
        // в нашем случае вместо картинки идет xml-файл,
        // который определяет картинку по состоянию вкладки
        tabSpec.setIndicator("Уитир-уажип", getResources().getDrawable(R.drawable.ic_arrow_drop_down_black_24dp));
        tabSpec.setContent(R.id.tvTab3);
        tabHost.addTab(tabSpec);

        // вторая вкладка будет выбрана по умолчанию
        tabHost.setCurrentTabByTag("tag1");
        textView.setText(stringBuilder);
        textView2.setText(stringBuilder2);
        textView3.setText(stringBuilder3);

        // обработчик переключения вкладок
        tabHost.setOnTabChangedListener(new TabHost.OnTabChangeListener() {
            public void onTabChanged(String tabId) {
                //Toast.makeText(getBaseContext(), "tabId = " + tabId, Toast.LENGTH_SHORT).show();
            }
        });
    }
    @Override
    public void onBackPressed() {
        super.onBackPressed();
        this.finish();
    }
}
