package com.example.zverek.myapplication;

import android.graphics.Typeface;
import android.os.Bundle;
import android.support.v7.app.AppCompatActivity;
import android.support.v7.widget.Toolbar;
import android.view.Window;
import android.view.WindowManager;
import android.widget.TabHost;
import android.widget.TextView;
import android.widget.Toast;


public class NamazBagymdatActivity extends AppCompatActivity {
    StringBuilder stringBuilder = new StringBuilder();
    StringBuilder stringBuilder2 = new StringBuilder();
    TextView textView1;
    TextView textView2;
    String pathToShrift2 = "fonts/calibri.ttf";
    Typeface typefacen2;
    String str1 = "Багымдат намазы\n" +
            "Алгач багымдат намазынын эки рекет сүннөтү анан эки рекет парзы окулат. Багымдат намазынын эки рекет сүннөтү төмөнкүчө окулат:\n" +
            "\n" +
            "1)   Ниет кылдым багымдат намазынын эки рекет сүннөтүн калыс Аллах үчүн окууга, жүзүмдү кыбылага бурдум.\n" +
            "\n" +
            "\n" +
            "2)   \"Аллооху Акбар\" - деп эки кол кулак жумашактарына көтөрүлөт, айалдар болсо көкүрөктөрүнө көтөрүшөт. Анан кол байланат.\n" +
            "\n" +
            "\n" +
            "3)   Оң кол сол колдун үстүнө койулуп киндиктин алдына байланат, айалдар болсо көкүрөктөрүнө байлашат. Бул акыбалда төмөнкүлөр окулат: \t\n" +
            "\tА) Субхаанака аллоохумма уа бихамдика уа табаарокасмука уа таалаа жаддука уа лаа илааха гойрук.\n" +
            "\tБ) Ауузу биллаахи минаш-шайтоонир-рожиим.\n" +
            "\tВ) Бисмил-лаахир-рохмаанир-рохиим.\n" +
            "\tГ) Алхамду лиллахи роббил ааламиин.\n" +
            "\tАррохмаанир-рохиим.\n" +
            "\tМаалики йаумид-диин.\n" +
            "\tИййаака набуду уа иййаака настаиин.\n" +
            "\tИхдинас-сыроотол-мустакыым.\n" +
            "\tСыроотол-лазиина анамта алайхим.\n" +
            "\tГойрил магдууби алайхим уа ладдоолиин.\n" +
            "\t\"Амиин\" - деп ичтен купуйа айтылат.\n" +
            "\tД) Кул хуал-лооху ахад, аллоохус-сомад\n" +
            "\tЛам йалид уа лам йуулад\n" +
            "\tУа лам йакул-лахуу куфууан ахад.\n" +
            "\t\"Аллоху Акбар\" - деп рүкүгө кетет.\n" +
            "\n" +
            "4)   Рүкүдө үч жолу \"Сухбаана роббийал азиим\" - деп айткан соң,\n" +
            "\t\"Самиаллооху лиман хамидах\" - деп кайра тик турат.\n" +
            "\n" +
            "\n" +
            "5)  Тик турган соң \"Аллооху Акбар\" - деп саждага кетет.\t\n" +
            "\tСажда абалында \"Субхаана роббийал аалаа\" - деп үч жолу айтылат,\n" +
            "\t\"Аллооху Акбар\" - деп баш көтөрүп каадага олтурат жана эки жолу \"Роббигфир лии\" - деп айтат.\n" +
            "\t Кайра экинчи саждага \"Аллооху Акбар\" - деп барып \"Субхаана роббийал аалаа\" - деп үч жолу айтылат.\n" +
            "     Мындан соң \"Аллооху Акбар\" - деп экинчи рекетке дароо туруп кол байлайт.\n" +
            "\n" +
            "\n" +
            "6)  Кол байлагандан кийин кайра Фатиха сүрөө кошумча сүрөө менен окулат:\n" +
            "\tБисмл-лаахир-рохмаанир-рохиим\n" +
            "\tАлхамду лиллаахи роббил ааламиин\n" +
            "\tАррохмаанир-рохиим.\n" +
            "\tМаалики йаумид-диин.\n" +
            "\tИййаака набуду уа иййаака настаиин.\n" +
            "\tИхдинас-сыроотол-мустакыым.\n" +
            "\tСыроотол-лазиина анамта алайхим.\n" +
            "\tГойрил магдууби алайхим уа ладдоолиин.\n" +
            "\t\"Амиин\" - деп ичтен купуйа айтылат.\n" +
            "\tКул ауузу бироббил фалак \n" +
            "\tМин шарри маа холак \n" +
            "\tУа мин шарри гоосикын иза уакоб\n" +
            "\tУа мин шаррин-наффаасаати фил укод\n" +
            "\tУа мин шарри хаасидин изаа хасад\n" +
            "\n" +
            "7)  Рүкүгө барат \"Аллооху Акбар\" - деп. Рүкүдө үч жолу \"Сухбаана роббийал азиим\" - деп айткан соң,\n" +
            "    \"Самиаллооху лиман хамидах\" - деп кайра тик турат.\n" +
            "\tТик турган соң \"Аллооху Акбар\" - деп саждага кетет. Сажда абалында \"Субхаана роббийал аалаа\" - деп үч жолу айтат,\n" +
            "\t\"Аллооху Акбар\" - деп баш көтөрүп каадага олтурат жана эки жолу \"Роббигфир лии\" - деп айтат.\n" +
            "\tайткан соң \"Аллооху Акбар\" - деп кайра экинчи сажданы кылат, саждада \"Субхаана роббийал аалаа\" - деп үч жолу айтат,\n" +
            "\t\"Аллооху Акбар\" - деп каадага олтурат.\n";

    String str2 = "\n\n8)  Каадада \"ат-тахыйат\" - дубасы окулат.\n" +
            "\tАттахыйаату лиллаахи уас-солауаату уат-тоййибаату\n" +
            "\tАссалааму алайка аййухан-набиййу \n" +
            "\tУа рохматуллоохи уа барокаатуху\n" +
            "\tАссалааму алайнаа уа алаа ыбаадил-лаахис-соолихиин\n" +
            "\tАшхаду аллаа илааха иллал-лооху\n" +
            "\tУа ашхаду анна мухаммадан абдуху уа росуулух \n" +
            "\n" +
            "\tМындан соң \"Салауат\" окулат.\n" +
            "\tАллоохумма солли алаа мухаммадин уа алаа аали мухаммад\n" +
            "\tКамаа соллайта алаа Иброохиима уа алаа аали Иброохима\n" +
            "\tИннака хамиидум-мажиид\n" +
            "\tАллоохумма баарик алаа мухаммадин уа алаа аали мухаммад\n" +
            "\tКамаа баарокта алаа Иброохиима уа алаа аали Иброохима\n" +
            "\tИннака хамиидум-мажиид."+
            "\tМындан соң бир дуба окулат:\n" +
            "\tРоббанаа аатинаа фид-дунйаа хасанатан \n" +
            "\tУа фил аахироти хасанатан \n" +
            "\tУа кынаа азаабан-наар.\n" +
            "\n" +
            "9) \"Ассалааму алайкум уа рохматуллох\" - деп оң ийинге салам берилет,\n" +
            "\tжана ушундай эле сол ийинге \"Ассалааму алайкум уа рохматуллох\"-салам берилет.\n" +
            "\n" +
            "\n" +
            "10) Эки тарапка салам берген соң \"Астагфируллоох\"- сөзүн үч мертебе айтып, \"Аллоохумма антас-салаам уа минкас-салаам табаарокта йаа зал жалаали уал \tикроом\" - деп эки алаканын жайып Алладан тилегин сурап жыйынтыктайт.\n" +
            "\n" +
            "Багымдат намазынын эки рекет сүннөтү бүттү деп эсептелет.";
    String str3 = "Багымдат намазынын эки рекет парзы төмөнкүчө окулат\n" +
            "1)  Ниет кылдым багымдат намазынын эки рекет парзын калыс Аллах үчүн окууга, жүзүмдү кыбылага бурдум.\n" +
            "\n" +
            "\n" +
            "2)  \"Аллооху Акбар\" - деп эки кол кулак жумашактарына көтөрүлөт, айалдар болсо көкүрөктөрүнө көтөрүшөт. Анан кол байланат.\n" +
            "\n" +
            "3)  Оң кол сол колдун үстүнө койулуп киндиктин алдына байланат, айалдар болсо көкүрөктөрүнө байлашат. Бул акыбалда төмөнкүлөр окулат:\n" +
            "\n" +
            "\t\tСубхаанака аллоохумма уа бихамдика уа табаарокасмука уа таалаа жаддука уа лаа илааха гойрук.\n" +
            "\t\tБ) Ауузу биллаахи минаш-шайтоонир-рожиим.\n" +
            "\t\tВ) Бисмил-лаахир-рохмаанир-рохиим.\n" +
            "\t\tГ) Алхамду лиллахи роббил ааламиин.\n" +
            "\t\tАррохмаанир-рохиим.\n" +
            "\t\tМаалики йаумид-диин.\n" +
            "\t\tИййаака набуду уа иййаака настаиин.\n" +
            "\t\tИхдинас-сыроотол-мустакыым.\n" +
            "\t\tСыроотол-лазиина анамта алайхим.\n" +
            "\t\tГойрил магдууби алайхим уа ладдоолиин.\n" +
            "\t\t\"Амиин\" - деп ичтен купуйа айтылат.\n" +
            "\t\tД) Кул хуал-лооху ахад, аллоохус-сомад\n" +
            "\t\tЛам йалид уа лам йуулад\n" +
            "\t\tУа лам йакул-лахуу куфууан ахад.\n" +
            "\t\t\"Аллоху Акбар\" - деп рүкүгө кетет.\n" +
            "\n" +
            "4)  Рүкүдө үч жолу \"Сухбаана роббийал азиим\" - деп айткан соң,\n" +
            "\t\t\"Самиаллооху лиман хамидах\" - деп кайра тик турат.\n" +
            "\n" +
            "\n" +
            "5)  Тик турган соң \"Аллооху Акбар\" - деп саждага кетет.\n" +
            "\t\tСажда абалында \"Субхаана роббийал аалаа\" - деп үч жолу айтылат,\n" +
            "\t\t\"Аллооху Акбар\" - деп баш көтөрүп каадага олтурат жана эки жолу \"Роббигфир лии\" - деп айтат.\n" +
            "\t\tКайра экинчи саждага \"Аллооху Акбар\" - деп барып \"Субхаана роббийал аалаа\" - деп үч жолу айтылат.\n" +
            "\t\tМындан соң \"Аллооху Акбар\" - деп экинчи рекетке туруп кол байлайт.\n" +
            "\n" +
            "\n" +
            "6)  Кол байлагандан кийин кайра Фатиха сүрөө кошумча сүрөө менен окулат: \n" +
            "\t\tБисмл-лаахир-рохмаанир-рохиим\n" +
            "\t\tАлхамду лиллаахи роббил ааламиин\n" +
            "\t\tАррохмаанир-рохиим.\n" +
            "\t\tМаалики йаумид-диин.\n" +
            "\t\tИййаака набуду уа иййаака настаиин.\n" +
            "\t\tИхдинас-сыроотол-мустакыым.\n" +
            "\t\tСыроотол-лазиина анамта алайхим.\n" +
            "\t\tГойрил магдууби алайхим уа ладдоолиин.\n" +
            "\t\t\"Амиин\" - деп ичтен купуйа айтылат.\n" +
            "\t\tКул ауузу бироббил фалак \n" +
            "\t\tМин шарри маа холак \n" +
            "\t\tУа мин шарри гоосикын иза уакоб\n" +
            "\t\tУа мин шаррин-наффаасаати фил укод\n" +
            "\t\tУа мин шарри хаасидин изаа хасад\n" +
            "\n" +
            "\n" +
            "7)  Рүкүгө барат \"Аллооху Акбар\" - деп. Рүкүдө үч жолу \"Сухбаана роббийал азиим\" - деп айткан соң,\n" +
            "\t\t\"Самиаллооху лиман хамидах\" - деп кайра тик турат.\n" +
            "\t\tТик турган соң \"Аллооху Акбар\" - деп саждага кетет. Сажда абалында \"Субхаана роббийал аалаа\" - деп үч жолу айтат,\n" +
            "\t\t\"Аллооху Акбар\" - деп баш көтөрүп каадага олтурат жана эки жолу \"Роббигфир лии\" - деп айтат.\n" +
            "\t\tАйткан соң \"Аллооху Акбар\" - деп кайра экинчи сажданы кылат, саждада \"Субхаана роббийал аалаа\" - деп үч жолу айтат,\n" +
            "\t\t\"Аллооху Акбар\" - деп баш көтөрүп каадага олтурат.";
    String str4 = "\n" +
            "\n" +
            "8)  Каадада \"ат-тахыйат\" - дубасы окулат.\n" +
            "\t\tАттахыйаату лиллаахи уас-солауаату уат-тоййибаату\n" +
            "\t\tАссалааму алайка аййухан-набиййу \n" +
            "\t\tУа рохматуллоохи уа барокаатуху\n" +
            "\t\tАссалааму алайнаа уа алаа ыбаадил-лаахис-соолихиин\n" +
            "\t\tАшхаду аллаа илааха иллал-лооху\n" +
            "\t\tУа ашхаду анна мухаммадан абдуху уа росуулух \n" +
            "\n" +
            "\t\tМындан соң \"Салауат\" окулат.\n" +
            "\t\tАллоохумма солли алаа мухаммадин уа алаа аали мухаммад\n" +
            "\t\tКамаа соллайта алаа Иброохиима уа алаа аали Иброохима\n" +
            "\t\tИннака хамиидум-мажиид\n" +
            "\t\tАллоохумма баарик алаа мухаммадин уа алаа аали мухаммад\n" +
            "\t\tКамаа баарокта алаа Иброохиима уа алаа аали Иброохима\n" +
            "\t\tИннака хамиидум-мажиид.\n" +
            "\n" +
            "\t\tМындан соң бир дуба окулат:\n" +
            "\t\tРоббанаа аатинаа фид-дунйаа хасанатан \n" +
            "\t\tУа фил аахироти хасанатан \n" +
            "\t\tУа кынаа азаабан-наар.\n" +
            "\n" +
            "\n" +
            "\n" +
            "9)  \"Ассалааму алайкум уа рохматуллох\" - деп оң ийинге салам берилет,\n" +
            "\tжана ушундай эле сол ийинге \"Ассалааму алайкум уа рохматуллох\"-салам берилет.\n" +
            "\n" +
            "\n" +
            "10)  Эки тарапка салам берген соң \"Астагфируллоох\"- сөзүн үч мертебе айтып, \"Аллоохумма антас-салаам уа минкас-салаам табаарокта йаа зал жалаали      \n" +
            "        уал икроом\" - деп эки алаканын жайып мындай дуба кылат: \"Аллохумма аыннии алаа зикрика уа шукрика уа хусни ыбаадатика\".\n" +
            "\t\tМындан соң багымдат намазынын парзы бүттү деп эсептелет.\n" +
            "\t\tКошумча зикирлер\n" +
            "\t\tАйат-ал Курсийди окуу:\n" +
            "\t\t\"Аллооху лаа илааха илла хуал хуййул коййум, лаа тахузуху синату уалаа наум лахуу маа фис-самаауаати уа маа фил арды ман заллазии йашфау ындахуу иллаа биизнихи йаламу маа байна айдиихим уа маа холфахум уа лаа йухыытууна бишайим мин ылмихи илла бимаа шаа уасиа курсиййухус-самаауаати уал ардо уа лаа йауудуху хыфзухума уа хуал алиййул азыым\".\n" +
            "\t\tАйат-алКурсини окуп бүткөн соң 33 жолу \"СубхаанАллах\", 33 жолу \"Алхамду лиллаах\", 33 жолу \"Аллоху Акбар\" жана бир жолу \"Лаа илааха иллаллооху уахдаху лаа шариика лахуу лахул мулку уа лахул хамду уа хуа алаа кулли шайин кодиир\" - деп көксөгөн тилек-максаттар суралып, дуба кылынат.";
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
         setContentView(R.layout.activity_namaz_bagymdat);
        typefacen2 = Typeface.createFromAsset(getAssets(),pathToShrift2);
        textView1 = (TextView) findViewById(R.id.tvTab1);
        textView2 = (TextView) findViewById(R.id.tvTab2);
        textView1.setTypeface(typefacen2);
        textView2.setTypeface(typefacen2);
        stringBuilder.append(str1);
        stringBuilder.append(str2);
        stringBuilder2.append(str3);
        stringBuilder2.append(str4);
        TabHost tabHost = (TabHost) findViewById(android.R.id.tabhost);
        // инициализация
        tabHost.setup();

        TabHost.TabSpec tabSpec;

        // создаем вкладку и указываем тег
        tabSpec = tabHost.newTabSpec("tag1");
        // название вкладки
        tabSpec.setIndicator("Суннот");
        // указываем id компонента из FrameLayout, он и станет содержимым
        tabSpec.setContent(R.id.tvTab1);
        // добавляем в корневой элемент
        tabHost.addTab(tabSpec);

        tabSpec = tabHost.newTabSpec("tag2");
        // указываем название и картинку
        // в нашем случае вместо картинки идет xml-файл,
        // который определяет картинку по состоянию вкладки
        tabSpec.setIndicator("Парз", getResources().getDrawable(R.drawable.ic_arrow_drop_down_black_24dp));
        tabSpec.setContent(R.id.tvTab2);
        tabHost.addTab(tabSpec);


        // вторая вкладка будет выбрана по умолчанию
        tabHost.setCurrentTabByTag("tag1");
        textView1.setText(stringBuilder);
        textView2.setText(stringBuilder2);
        // обработчик переключения вкладок
        tabHost.setOnTabChangedListener(new TabHost.OnTabChangeListener() {
            public void onTabChanged(String tabId) {
                //Toast.makeText(getBaseContext(), "tabId = " + tabId, Toast.LENGTH_SHORT).show();
            }
        });
    }
    @Override
    public void onBackPressed() {
        super.onBackPressed();
        this.finish();
    }
}
